Autodesk.Revit.DB.Structure.RebarEndType
Describes what is added at the end of a Rebar.
Since:
2026
Since:
2026

Autodesk.Revit.DB.Structure.RebarEndType.Crank
A Crank is added to the end of the Rebar.

Autodesk.Revit.DB.Structure.RebarEndType.EndTreatment
An End Treatment is added to the end of the Rebar.

Autodesk.Revit.DB.Structure.RebarEndType.Hook
A Hook is added to the end of the Rebar.

Autodesk.Revit.DB.Structure.RebarEndType.None
There is nothing added to the end of the Rebar.